In [167]:
import pandas as pd
import numpy as np

In [249]:
num = int(input("please enter a number: "))
hexadec(num)
octaly(num)
binary(num)

please enter a number: 8

'1000'

In [247]:
def hexadec(num):
    bins = ''
    hexa ={0: '0', 1: '1', 2: '2', 3: '3', 4: '4',  5: '5', 6: '6', 7: '7',
                    8: '8', 9: '9', 10: 'A', 11: 'B', 12: 'C', 13: 'D', 14: 'E', 15: 'F'}
    while num!=0:
        bins = hexa[num%16] + bins
        num = num//16
    return bins

In [246]:
def octaly(num):
    bins = ''
    while num % 8 != 0:
        bins = str(num%8) + bins
        num = num//8
    return bins

In [245]:
def binary(num):
    bins =''
    while (num>0):
        bins = str(num%2) + bins
        num= num//2
    return bins

In [52]:
df = pd.read_csv('C:\לימודים\מבוא למדעי הנתונים\פרויקט גמר\cast.csv')
df

,title,year,name,type,character,n
0,Suuri illusioni,1985,Homo $,actor,Guests,22.0
1,Gangsta Rap: The Glockumentary,2007,Too $hort,actor,Himself,NaN
2,Menace II Society,1993,Too $hort,actor,Lew-Loc,27.0
3,Porndogs: The Adventures of Sadie,2009,Too $hort,actor,Bosco,3.0
4,Stop Pepper Palmer,2014,Too $hort,actor,Himself,NaN
...,...,...,...,...,...,...
3333690,Stuttur Frakki,1993,Sveinbj?rg ??rhallsd?ttir,actress,Flugfreyja,24.0
3333691,Foxtrot,1988,Lilja ??risd?ttir,actress,D?ra,24.0
3333692,Niceland (Population. 1.000.002),2004,Sigr??ur J?na ??risd?ttir,actress,Woman in Bus,26.0
3333693,U.S.S.S.S...,2003,Krist?n Andrea ??r?ard?ttir,actress,Afgr.dama ? bens?nst??,17.0
3333694,Bye Bye Blue Bird,1999,Rosa ? R?gvu,actress,Pensionatv?rtinde,NaN

In [67]:
len(df[df['title']=='Hamlet'])

299

In [65]:
Treasure_Island = df[df['title']=='Treasure Island']
Treasure_Island = Treasure_Island.set_index('year')
Treasure_Island = Treasure_Island.sort_index()
Treasure_Island

                title                  name     type         character     n
year
1918  Treasure Island       Herschel Mayall    actor   Prologue Player   NaN
1918  Treasure Island    Eleanor Washington  actress   Prologue Player   NaN
1918  Treasure Island      Violet Radcliffe  actress  Long John Silver   3.0
1918  Treasure Island           Raymond Lee    actor          Bit Role   NaN
1918  Treasure Island          Elmo Lincoln    actor   Prologue Player   NaN
...               ...                   ...      ...               ...   ...
1999  Treasure Island  Victor Raider-Wexler    actor          Samowitz  10.0
1999  Treasure Island  Scot Thomas Robinson    actor             Jimmy  11.0
1999  Treasure Island        Richard Schave    actor               Man  21.0
1999  Treasure Island    Stephanie Ittleson  actress            Stella   7.0
1999  Treasure Island          Rio Hackford    actor              Hans  23.0

[187 rows x 5 columns]

In [74]:
Hamlet.groupby(Hamlet.year // 10 * 10).size()

year
1910    28
1920     9
1940    25
1950     1
1960    57
1970    19
1980     3
1990    84
2000    55
2010    18
dtype: int64

In [93]:
Hamlet = df[df['title']=='Hamlet']
Hamlet.groupby(Hamlet.year // 10 * 10).year.sum()

year
1910     53549
1920     17289
1940     48700
1950      1954
1960    112068
1970     37520
1980      5961
1990    167490
2000    110153
2010     36222
Name: year, dtype: int64

In [100]:
test = df[df.n==1]
test  = test[(test['year']>=1950) & (test['year']<1960)]
test_men = test[test['type']=='actor']
test_women = test[test['type']=='actress']
len(test_men) , len(test_women)

(6388, 2813)

In [143]:
test = df[df['year']>1990]
test = test[test['n']==1]
test = test.groupby(['name']).sum()
test.sort_values('n').tail(10)

                      year      n
name
Dilip               118180   59.0
Nagarjuna Akkineni  118078   59.0
Amitabh Bachchan    132261   66.0
Eric Roberts        134496   67.0
Andy Lau            135909   68.0
Ajay Devgn          138169   69.0
Jayaram             147967   74.0
Akshay Kumar        174307   87.0
Mammootty           210438  105.0
Mohanlal            232346  116.0

In [148]:
test = df[df['name']=='Frank oz ']
test

Empty DataFrame
Columns: [title, year, name, type, character, n]
Index: []